SLM-Simulation/0/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type           zeroGradient;
    }
    right
    {
        type            zeroGradient;

    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
       type           inletOutlet;
        inletValue     uniform 0;
        value          uniform 0;
    }
    frontAndBack
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
