SLM-Simulation/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleEnthalpy;
}

// ************************************************************************* //

mixture
{
    specie
    {
        nMoles          1;
        molWeight       125.79;
    }
    equationOfState
    {
        beta            8e-6;
        rho0            3920;
        T0              301.3;
    }
    thermodynamics
    {
        Cp              381;
        Hf              2.7e5;
    }
    transport
    {
        mu              0.5e-3;
        Pr              0.031;
    }
}

// ************************************************************************* //
