SLM-Simulation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (-2 -1 -0.5)
    (2 -1 -0.5)
    (2 1 -0.5)
    (-2 1 -0.5)
    (-2 -1 0.5)
    (2 -1 0.5)
    (2 1 0.5)
    (-2 1 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 20 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    right
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type patch;
        faces
        (
             (4 5 6 7)
        );
    }
    frontAndBack
    {
        type wall;
        faces
        (
            (2 6 5 1)
            (0 4 7 3)
        );
    }
);

// ************************************************************************* //
